tutorial/flap/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

mover {
    libs ("libfvMeshMovers.so" "libfvMotionSolvers.so");
    type motionSolver;
    motionSolver displacementLaplacian;
    
	displacementLaplacianCoeffs {
        diffusivity quadratic inverseDistance (flap);
	}
}


dynamicFvMesh    dynamicOversetFvMesh;

motionSolverLibs (fvMotionSolvers);

solver           displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity quadratic inverseDistance (flap);
}

